In [1]:

# Importing the libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pickle

In [2]:
df = pd.read_csv('hiring.csv')
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [3]:
#df.columns.rename("test_score(out of 10)".test_score)
df.shape

(8, 4)

In [4]:
df["experience"].fillna(0,inplace=True)
df["test_score(out of 10)"].fillna(df["test_score(out of 10)"].mean(), inplace = True)
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [5]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [6]:
#creating test data set
X = df.drop(['salary($)'], axis=1) 
X.head()

  experience  test_score(out of 10)  interview_score(out of 10)
0          0                    8.0                           9
1          0                    8.0                           6
2       five                    6.0                           7
3        two                   10.0                          10
4      seven                    9.0                           6

In [7]:
#converting words to integer values
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}
    return word_dict[word]

X['experience'] = X['experience'].apply(lambda x: convert_to_int(x))

X.head()

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6

In [8]:
#creating target variable
y = df['salary($)']
y.head()

0    50000
1    45000
2    60000
3    65000
4    70000
Name: salary($), dtype: int64

In [9]:
#split train and test 
#it is very samll data we'll use all 
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [10]:
#fiting our data
regressor.fit(X,y)

LinearRegression()

In [11]:
#saving model to disk
pickle.dump(regressor, open('model.pkl','wb'))

In [12]:
#loading modle to compare the result
model = pickle.load(open('model.pkl', 'rb'))
print(model.predict([[2,9,6]]) )

[53290.89255945]